{"config": [{"config": {"dtype": "float32", "bias_constraint": null, "strides": [1, 1], "batch_input_shape": [null, 40, 1200, 3], "use_bias": true, "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "valid", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "kernel_constraint": null, "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null, "filters": 8, "name": "conv2d_1", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"padding": "valid", "bias_constraint": null, "strides": [1, 1], "use_bias": true, "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null, "filters": 16, "name": "conv2d_2", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"padding": "valid", "bias_constraint": null, "strides": [1, 1], "use_bias": true, "data_format": "channels_last", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "sigmoid", "kernel_constraint": null, "kernel_size": [3, 3], "trainable": true, "bias_regularizer": null, "filters": 24, "name": "conv2d_3", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "strides": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "use_bias": true, "units": 64, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "relu", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.4}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "use_bias": true, "units": 12, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "softmax", "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "name": "dense_2"}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2"}