{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [7, 7], "trainable": true, "bias_regularizer": null, "dtype": "float32", "name": "conv2d_1", "filters": 8, "strides": [1, 1], "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_constraint": null, "batch_input_shape": [null, 40, 1200, 3], "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "trainable": true, "bias_regularizer": null, "strides": [1, 1], "filters": 16, "name": "conv2d_2", "dilation_rate": [1, 1], "use_bias": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "trainable": true, "bias_regularizer": null, "strides": [1, 1], "filters": 24, "name": "conv2d_3", "dilation_rate": [1, 1], "use_bias": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_constraint": null, "activity_regularizer": null, "activation": "sigmoid", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "units": 256, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.4}}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "units": 12, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activity_regularizer": null, "activation": "softmax", "kernel_regularizer": null, "bias_constraint": null}}]}