{"keras_version": "2.0.2", "backend": "tensorflow", "config": [{"config": {"activity_regularizer": null, "batch_input_shape": [null, 40, 1200, 3], "data_format": "channels_last", "trainable": true, "use_bias": true, "name": "conv2d_7", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "strides": [1, 1], "filters": 8, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32", "kernel_size": [4, 4], "kernel_constraint": null, "activation": "relu", "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_5", "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "use_bias": true, "name": "conv2d_8", "bias_constraint": null, "strides": [1, 1], "filters": 16, "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "activation": "relu", "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_6", "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "use_bias": true, "name": "conv2d_9", "bias_constraint": null, "strides": [1, 1], "filters": 24, "kernel_regularizer": null, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_constraint": null, "activation": "sigmoid", "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "trainable": true, "data_format": "channels_last", "name": "max_pooling2d_7", "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_5", "trainable": true, "rate": 0.4}, "class_name": "Dropout"}, {"config": {"name": "flatten_3", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "name": "dense_5", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "softmax", "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "units": 12, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential"}