{"class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "batch_input_shape": [null, 40, 1200, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dtype": "float32", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "name": "conv2d_5", "filters": 8, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_3"}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "use_bias": true, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "name": "conv2d_6", "filters": 16}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}}, {"class_name": "Dense", "config": {"units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "use_bias": true, "kernel_constraint": null, "name": "dense_4"}}, {"class_name": "Dense", "config": {"units": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "use_bias": true, "kernel_constraint": null, "name": "dense_5"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.4}}, {"class_name": "Dense", "config": {"units": 12, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_regularizer": null, "activation": "softmax", "use_bias": true, "kernel_constraint": null, "name": "dense_6"}}]}