{"class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "dtype": "float32", "filters": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "batch_input_shape": [null, 40, 1200, 3], "activation": "relu", "padding": "valid", "name": "conv2d_1", "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "relu", "padding": "valid", "name": "conv2d_2", "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "strides": [1, 1], "trainable": true, "bias_constraint": null, "kernel_size": [3, 3], "filters": 24, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "activation": "sigmoid", "padding": "valid", "name": "conv2d_3", "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_3", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "units": 256, "activation": "relu", "activity_regularizer": null, "name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.4, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "units": 12, "activation": "softmax", "activity_regularizer": null, "name": "dense_2", "bias_regularizer": null, "kernel_regularizer": null}}]}