{"backend": "tensorflow", "config": [{"config": {"name": "conv2d_1", "batch_input_shape": [null, 40, 1200, 3], "activity_regularizer": null, "bias_regularizer": null, "padding": "valid", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 8, "kernel_size": [7, 7], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "activation": "relu", "strides": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_2", "activity_regularizer": null, "bias_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "filters": 16, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "activation": "relu", "strides": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_3", "activity_regularizer": null, "bias_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "filters": 24, "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": null, "data_format": "channels_last", "activation": "sigmoid", "strides": [1, 1], "use_bias": true, "trainable": true, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "use_bias": true, "trainable": true, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"rate": 0.4, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 12, "bias_constraint": null, "bias_regularizer": null, "activation": "softmax", "use_bias": true, "trainable": true, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.2"}