{"backend": "tensorflow", "keras_version": "2.0.2", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activation": "relu", "padding": "valid", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "kernel_size": [7, 7], "dtype": "float32", "strides": [1, 1], "name": "conv2d_1", "kernel_regularizer": null, "use_bias": true, "batch_input_shape": [null, 40, 1200, 3], "kernel_constraint": null, "activity_regularizer": null, "filters": 8, "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "padding": "valid", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "conv2d_2", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "filters": 16, "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "relu", "padding": "valid", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "conv2d_3", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "filters": 16, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"activation": "sigmoid", "padding": "valid", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "trainable": true, "strides": [1, 1], "name": "conv2d_4", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "filters": 24, "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_3", "padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"units": 256, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.4}}, {"class_name": "Dense", "config": {"units": 12, "activation": "softmax", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "kernel_regularizer": null, "name": "dense_2", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null}}]}