{"config": [{"config": {"name": "conv2d_1", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 40, 1200, 3], "dtype": "float32", "use_bias": true, "activation": "relu", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [7, 7], "filters": 8, "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_2", "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "sigmoid", "strides": [1, 1], "kernel_size": [3, 3], "filters": 24, "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "relu", "kernel_constraint": null, "units": 256, "trainable": true, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.4}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "softmax", "kernel_constraint": null, "units": 12, "trainable": true, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.2"}