{"config": [{"config": {"bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "kernel_size": [4, 4], "batch_input_shape": [null, 40, 1200, 3], "padding": "valid", "dtype": "float32", "bias_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "filters": 8, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "padding": "valid", "name": "conv2d_2", "bias_regularizer": null, "data_format": "channels_last", "filters": 16, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "sigmoid", "kernel_size": [3, 3], "padding": "valid", "name": "conv2d_3", "bias_regularizer": null, "data_format": "channels_last", "filters": 24, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "units": 256, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "name": "dense_1", "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"rate": 0.4, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "units": 12, "kernel_constraint": null, "kernel_regularizer": null, "activation": "softmax", "name": "dense_2", "activity_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential"}