{"config": [{"config": {"kernel_size": [4, 4], "padding": "valid", "filters": 8, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 40, 1200, 3], "kernel_constraint": null, "dtype": "float32", "trainable": true, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_regularizer": null, "strides": [1, 1], "activation": "relu", "name": "conv2d_10", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_7", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_size": [3, 3], "padding": "valid", "filters": 16, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_11", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": true, "name": "max_pooling2d_8", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_7", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_4", "trainable": true}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "units": 256, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_7"}, "class_name": "Dense"}, {"config": {"name": "dropout_8", "rate": 0.4, "trainable": true}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activation": "softmax", "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "units": 12, "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_8"}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.2"}