{"config": [{"config": {"batch_input_shape": [null, 40, 1200, 3], "filters": 8, "kernel_size": [5, 5], "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "data_format": "channels_last", "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_7", "kernel_regularizer": null, "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_7"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 16, "padding": "valid", "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "activation": "relu", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_8", "kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_8"}, "class_name": "MaxPooling2D"}, {"config": {"filters": 24, "padding": "valid", "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "activation": "sigmoid", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_9", "kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3], "activity_regularizer": null, "use_bias": true}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_9"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "name": "dropout_5", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_3", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "units": 256, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_5", "use_bias": true}, "class_name": "Dense"}, {"config": {"rate": 0.4, "name": "dropout_6", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "units": 12, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_6", "use_bias": true}, "class_name": "Dense"}], "keras_version": "2.0.2", "backend": "tensorflow", "class_name": "Sequential"}